#pragma once

// Name: Robogore, Version: 1.1.176

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class Robogore.AbilityChangedEvent
// 0x0008 (0x0040 - 0x0038)
class UAbilityChangedEvent : public UV1EventBase
{
public:
	bool                                               canSnap;                                                  // 0x0038(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AbilityChangedEvent");
		return ptr;
	}

};


// Class Robogore.AbilityElement_Weapon
// 0x0000 (0x0038 - 0x0038)
class UAbilityElement_Weapon : public UV1AbilityElement
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AbilityElement_Weapon");
		return ptr;
	}

};


// Class Robogore.AbilityStagingHUDWidget
// 0x0038 (0x0270 - 0x0238)
class UAbilityStagingHUDWidget : public UV1UserWidget
{
public:
	class UImage*                                      m_unitIcon;                                               // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      m_abilityIcon;                                            // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  m_abilityName;                                            // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  m_abilityDescription;                                     // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class AUnitBaseActor*                              m_unit;                                                   // 0x0258(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UUnitAbilityComponent*                       m_ability;                                                // 0x0260(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	int                                                m_inputIndex;                                             // 0x0268(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x026C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AbilityStagingHUDWidget");
		return ptr;
	}

};


// Class Robogore.RobogoreBaseMenu
// 0x0008 (0x0370 - 0x0368)
class URobogoreBaseMenu : public UV1ElementMenu
{
public:
	unsigned char                                      m_recordNavigationAnalytics : 1;                          // 0x0368(0x0001) (Edit)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0369(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.RobogoreBaseMenu");
		return ptr;
	}

};


// Class Robogore.AchievementsMenu
// 0x0038 (0x03A8 - 0x0370)
class UAchievementsMenu : public URobogoreBaseMenu
{
public:
	class UV1TileScrollBoxUserWidget*                  m_tileScrollBoxWidget;                                    // 0x0370(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FMargin                                     m_itemPaddingForTileScrollWidget;                         // 0x0378(0x0010) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      m_achievementTileWidgetClass;                             // 0x0388(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                m_numberOfTempTiles;                                      // 0x0390(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x14];                                      // 0x0394(0x0014) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AchievementsMenu");
		return ptr;
	}


	void OnPressedTile(class UWidget** PressedWidget);
	void OnHoveredTile(class UWidget** HoveredWidget);
	void OnHoveredAchievementTile_BP(struct FAchievementData* Data);
};


// Class Robogore.AchievementTileWidget
// 0x0030 (0x03A8 - 0x0378)
class UAchievementTileWidget : public UV1ListItemUserWidget
{
public:
	struct FAchievementData                            m_achievementData;                                        // 0x0378(0x0030) (Edit, BlueprintVisible)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AchievementTileWidget");
		return ptr;
	}


	void SetAchievementTileData_BP(struct FAchievementData* Data);
};


// Class Robogore.ActivePulseLocation_Context
// 0x0000 (0x0028 - 0x0028)
class UActivePulseLocation_Context : public UEnvQueryContext
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActivePulseLocation_Context");
		return ptr;
	}

};


// Class Robogore.ActivePulseDirection_Context
// 0x0000 (0x0028 - 0x0028)
class UActivePulseDirection_Context : public UEnvQueryContext
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActivePulseDirection_Context");
		return ptr;
	}

};


// Class Robogore.RobogoreUserWidget
// 0x0040 (0x0278 - 0x0238)
class URobogoreUserWidget : public UV1UserWidget
{
public:
	class URobogoreUserWidget*                         m_parent;                                                 // 0x0238(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	bool                                               m_setKeyboardFocusOnSetVisibile;                          // 0x0240(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x37];                                      // 0x0241(0x0037) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.RobogoreUserWidget");
		return ptr;
	}


	void GotoParentWidget();
};


// Class Robogore.BaseActorIdentifierWidget
// 0x0008 (0x0280 - 0x0278)
class UBaseActorIdentifierWidget : public URobogoreUserWidget
{
public:
	class UBorder*                                     m_contentAlphaContainer;                                  // 0x0278(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.BaseActorIdentifierWidget");
		return ptr;
	}

};


// Class Robogore.ActorIconWidget
// 0x0008 (0x0288 - 0x0280)
class UActorIconWidget : public UBaseActorIdentifierWidget
{
public:
	class UImage*                                      imgIcon;                                                  // 0x0280(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIconWidget");
		return ptr;
	}

};


// Class Robogore.ScalingWidgetComponent
// 0x0040 (0x0730 - 0x06F0)
class UScalingWidgetComponent : public UWidgetComponent
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x06F0(0x0004) MISSED OFFSET
	struct FWidgetScaleConfig                          m_scaleConfig;                                            // 0x06F4(0x001C) (Edit)
	struct FWorldWidgetComponentParentData             m_widgetParentData;                                       // 0x0710(0x0018) (Transient)
	unsigned char                                      UnknownData01[0x8];                                       // 0x0728(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ScalingWidgetComponent");
		return ptr;
	}

};


// Class Robogore.BaseActorIdentifierWidgetComponent
// 0x0000 (0x0730 - 0x0730)
class UBaseActorIdentifierWidgetComponent : public UScalingWidgetComponent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.BaseActorIdentifierWidgetComponent");
		return ptr;
	}

};


// Class Robogore.ActorIconWidgetComponent
// 0x0020 (0x0750 - 0x0730)
class UActorIconWidgetComponent : public UBaseActorIdentifierWidgetComponent
{
public:
	class UClass*                                      m_actorIconWidgetClass;                                   // 0x0730(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorIconWidgetRelationshipData*            m_defaultRelationshipBasedWidgetData;                     // 0x0738(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorIconWidgetObject*                      m_actorIconWidgetObject;                                  // 0x0740(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0748(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIconWidgetComponent");
		return ptr;
	}

};


// Class Robogore.BaseActorIdentifierWidgetObject
// 0x0070 (0x0098 - 0x0028)
class UBaseActorIdentifierWidgetObject : public UObject
{
public:
	class AActor*                                      m_outerActor;                                             // 0x0028(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UBaseActorIdentifierWidget*                  m_identifierWidget;                                       // 0x0030(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UInteractableObjectComponent*                m_localInteractableComponent;                             // 0x0038(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UTeamComponent*                              m_localTeamComponent;                                     // 0x0040(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	struct FGameplayTag                                m_thisWidgetTypeTag;                                      // 0x0048(0x0008) (Transient)
	unsigned char                                      UnknownData00[0x48];                                      // 0x0050(0x0048) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.BaseActorIdentifierWidgetObject");
		return ptr;
	}

};


// Class Robogore.ActorIconWidgetObject
// 0x0018 (0x00B0 - 0x0098)
class UActorIconWidgetObject : public UBaseActorIdentifierWidgetObject
{
public:
	class UActorIconWidgetRelationshipData*            m_defaultRelationshipBasedWidgetData;                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UActorIconWidget*                            m_actorIconWidgetInstance;                                // 0x00A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00A8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIconWidgetObject");
		return ptr;
	}

};


// Class Robogore.ActorIdentifierCombinedWidget
// 0x0020 (0x02A0 - 0x0280)
class UActorIdentifierCombinedWidget : public UBaseActorIdentifierWidget
{
public:
	class UActorMortalityWidget*                       m_mortalityWidget;                                        // 0x0280(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorNameplateWidget*                       m_nameplateWidget;                                        // 0x0288(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorIconWidget*                            m_iconWidget;                                             // 0x0290(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      m_unitChatterIcon;                                        // 0x0298(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIdentifierCombinedWidget");
		return ptr;
	}

};


// Class Robogore.ActorIdentifierCombinedWidgetComponent
// 0x0270 (0x09A0 - 0x0730)
class UActorIdentifierCombinedWidgetComponent : public UBaseActorIdentifierWidgetComponent
{
public:
	bool                                               m_isEnabled;                                              // 0x0730(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0731(0x0007) MISSED OFFSET
	class UClass*                                      m_actorIdentifierCombinedWidgetClass;                     // 0x0738(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UClass*                                      m_actorIdentifierCombinedOffscreenWidgetClass;            // 0x0740(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorIdentifierCombinedWidgetRelationshipData* m_defaultRelationshipBasedWidgetData;                     // 0x0748(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorMortalityWidgetRelationshipData*       m_mortalityRelationshipWidgetData;                        // 0x0750(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorNameplateWidgetRelationshipData*       m_nameplateRelationshipWidgetData;                        // 0x0758(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorIconWidgetRelationshipData*            m_iconRelationshipWidgetData;                             // 0x0760(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FActorNameAndTypeConfig                     m_nameAndTypeConfig;                                      // 0x0768(0x00A0) (Edit)
	struct FSlateBrush                                 m_actorIcon;                                              // 0x0808(0x0088) (Edit)
	struct FSlateBrush                                 m_cachedActorIcon;                                        // 0x0890(0x0088) (Transient)
	class UActorIdentifierCombinedWidget*              m_actorIdentifierCombinedWidgetInstance;                  // 0x0918(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UUnitOffscreenWidget*                        m_actorIdentifierCombinedOffscreenWidgetInstance;         // 0x0920(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	class UActorMortalityWidgetObject*                 m_actorMortalityWidgetObject;                             // 0x0928(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UActorNameplateWidgetObject*                 m_actorNameplateWidgetObject;                             // 0x0930(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UActorIconWidgetObject*                      m_actorIconWidgetObject;                                  // 0x0938(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UInteractableObjectComponent*                m_localInteractableComponent;                             // 0x0940(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData01[0x48];                                      // 0x0948(0x0048) MISSED OFFSET
	class USceneComponent*                             m_cachedAttachedParent;                                   // 0x0990(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData02[0x8];                                       // 0x0998(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIdentifierCombinedWidgetComponent");
		return ptr;
	}


	struct FText GetActorType();
	struct FText GetActorName();
	struct FSlateBrush GetActorIconBrush();
};


// Class Robogore.ActorIdentifierCombinedWidgetRelationshipData
// 0x0050 (0x0080 - 0x0030)
class UActorIdentifierCombinedWidgetRelationshipData : public UDataAsset
{
public:
	TMap<EeTeamRelationship, struct FActorIdentifierCombinedWidgetConfig> m_relationshipMapping;                                    // 0x0030(0x0050) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIdentifierCombinedWidgetRelationshipData");
		return ptr;
	}

};


// Class Robogore.ActorIdentifiersOverrideComponent
// 0x0140 (0x0268 - 0x0128)
class UActorIdentifiersOverrideComponent : public UActorComponent
{
public:
	TMap<struct FGameplayTag, class UActorMortalityWidgetRelationshipData*> m_mortalityWidgetOverrides;                               // 0x0128(0x0050) (Edit, ZeroConstructor)
	TMap<struct FGameplayTag, class UActorIconWidgetRelationshipData*> m_iconWidgetOverrides;                                    // 0x0178(0x0050) (Edit, ZeroConstructor)
	TMap<struct FGameplayTag, class UActorNameplateWidgetRelationshipData*> m_nameplateWidgetOverrides;                               // 0x01C8(0x0050) (Edit, ZeroConstructor)
	TMap<struct FGameplayTag, class UActorIdentifierCombinedWidgetRelationshipData*> m_combinedWidgetOverrides;                                // 0x0218(0x0050) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIdentifiersOverrideComponent");
		return ptr;
	}

};


// Class Robogore.ActorIdentifiersOverrideInterface
// 0x0000 (0x0028 - 0x0028)
class UActorIdentifiersOverrideInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIdentifiersOverrideInterface");
		return ptr;
	}

};


// Class Robogore.ActorIlluminationComponent
// 0x0100 (0x0228 - 0x0128)
class UActorIlluminationComponent : public UActorComponent
{
public:
	struct FIllumData                                  m_illumDataMaterials;                                     // 0x0128(0x0030) (Edit)
	TArray<class UMaterialInterface*>                  m_materialsToSwap;                                        // 0x0158(0x0010) (Edit, ZeroConstructor)
	struct FIllumData                                  m_illumDataParticles;                                     // 0x0168(0x0030) (Edit)
	struct FIllumData                                  m_illumDataLights;                                        // 0x0198(0x0030) (Edit)
	class UTeamComponent*                              m_teamComponent;                                          // 0x01C8(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	EeTeamRelationship                                 m_previousRelationshipToLocalPlayer;                      // 0x01D0(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x01D1(0x0007) MISSED OFFSET
	TArray<struct FActorIllumMaterialInstance>         m_materialInstances;                                      // 0x01D8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FActorIllumParticleInstance>         m_particleSystemInstances;                                // 0x01E8(0x0010) (ZeroConstructor, Transient)
	TArray<struct FActorIllumLightInstance>            m_lightInstances;                                         // 0x01F8(0x0010) (ZeroConstructor, Transient)
	bool                                               m_initialized;                                            // 0x0208(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x1F];                                      // 0x0209(0x001F) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIlluminationComponent");
		return ptr;
	}

};


// Class Robogore.ActorIconWidgetRelationshipData
// 0x0050 (0x0080 - 0x0030)
class UActorIconWidgetRelationshipData : public UDataAsset
{
public:
	TMap<EeTeamRelationship, struct FActorIconWidgetConfig> m_relationshipMapping;                                    // 0x0030(0x0050) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorIconWidgetRelationshipData");
		return ptr;
	}

};


// Class Robogore.ActorKillDataEvent
// 0x0010 (0x0048 - 0x0038)
class UActorKillDataEvent : public UV1EventBase
{
public:
	TArray<class UKillData*>                           m_killData;                                               // 0x0038(0x0010) (ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorKillDataEvent");
		return ptr;
	}

};


// Class Robogore.ActorMortalityHitPipWidget
// 0x00A8 (0x0320 - 0x0278)
class UActorMortalityHitPipWidget : public URobogoreUserWidget
{
public:
	class UImage*                                      m_pipImage;                                               // 0x0278(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UWidgetAnimation*                            m_hitPipWidgetAnimation;                                  // 0x0280(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_actualRatioParameterName;                               // 0x0288(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_interpolatingRatioParameterName;                        // 0x0290(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FRuntimeFloatCurve                          m_animationPlaybackScaleBasedOnDamageRatio;               // 0x0298(0x0088) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorMortalityHitPipWidget");
		return ptr;
	}


	void OnAnimationComplete();
};


// Class Robogore.ActorMortalityWidget
// 0x00B8 (0x0338 - 0x0280)
class UActorMortalityWidget : public UBaseActorIdentifierWidget
{
public:
	class UImage*                                      m_currentHealthFillImage;                                 // 0x0280(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      m_missingHealthFillImage;                                 // 0x0288(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      m_currentShieldFillImage;                                 // 0x0290(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UImage*                                      m_missingShieldFillImage;                                 // 0x0298(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  m_healthPercentageText;                                   // 0x02A0(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UPanelWidget*                                m_healthShieldWrapper;                                    // 0x02A8(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorMortalityHitPipWidget*                 m_hitPip1;                                                // 0x02B0(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorMortalityHitPipWidget*                 m_hitPip2;                                                // 0x02B8(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorMortalityHitPipWidget*                 m_hitPip3;                                                // 0x02C0(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UActorMortalityHitPipWidget*                 m_hitPip4;                                                // 0x02C8(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	float                                              m_maxHitPipDistanceCM;                                    // 0x02D0(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_interpolatingValueMaterialParameter;                    // 0x02D4(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_actualValueMaterialParameter;                           // 0x02DC(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              m_interpolationSpeed;                                     // 0x02E4(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	TArray<struct FGameplayTag>                        m_gameplayEffectCategoriesThatCauseUniqueHitEvent;        // 0x02E8(0x0010) (Edit, ZeroConstructor)
	TArray<class UActorMortalityHitPipWidget*>         m_hitPipWidgetInstances;                                  // 0x02F8(0x0010) (ExportObject, ZeroConstructor, Transient)
	class AActor*                                      m_owningActor;                                            // 0x0308(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x28];                                      // 0x0310(0x0028) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorMortalityWidget");
		return ptr;
	}


	void OnUnderEffectHealthDamageTaken(struct FGameplayTag* categoryTag);
	void OnShieldDamageTaken();
	void OnRegenerateShield();
	void OnRegenerateHealth();
	void OnHealthDamageTaken();
};


// Class Robogore.ActorMortalityWidgetComponent
// 0x0020 (0x0750 - 0x0730)
class UActorMortalityWidgetComponent : public UBaseActorIdentifierWidgetComponent
{
public:
	class UClass*                                      m_actorMortalityWidgetClass;                              // 0x0730(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorMortalityWidgetRelationshipData*       m_defaultRelationshipBasedWidgetData;                     // 0x0738(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorMortalityWidgetObject*                 m_actorMortalityWidgetObject;                             // 0x0740(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0748(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorMortalityWidgetComponent");
		return ptr;
	}

};


// Class Robogore.ActorMortalityWidgetObject
// 0x0020 (0x00B8 - 0x0098)
class UActorMortalityWidgetObject : public UBaseActorIdentifierWidgetObject
{
public:
	class UActorMortalityWidgetRelationshipData*       m_defaultRelationshipBasedWidgetData;                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UActorMortalityWidget*                       m_actorMortalityWidgetInstance;                           // 0x00A0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x10];                                      // 0x00A8(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorMortalityWidgetObject");
		return ptr;
	}

};


// Class Robogore.ActorMortalityWidgetRelationshipData
// 0x0050 (0x0080 - 0x0030)
class UActorMortalityWidgetRelationshipData : public UDataAsset
{
public:
	TMap<EeTeamRelationship, struct FActorMortalityWidgetConfig> m_relationshipMapping;                                    // 0x0030(0x0050) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorMortalityWidgetRelationshipData");
		return ptr;
	}

};


// Class Robogore.ActorNameplateWidget
// 0x0010 (0x0290 - 0x0280)
class UActorNameplateWidget : public UBaseActorIdentifierWidget
{
public:
	class UTextBlock*                                  m_nameText;                                               // 0x0280(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UTextBlock*                                  m_typeText;                                               // 0x0288(0x0008) (Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorNameplateWidget");
		return ptr;
	}

};


// Class Robogore.KillData
// 0x0000 (0x0028 - 0x0028)
class UKillData : public UObject
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.KillData");
		return ptr;
	}

};


// Class Robogore.ActorNameplateWidgetComponent
// 0x0050 (0x0780 - 0x0730)
class UActorNameplateWidgetComponent : public UBaseActorIdentifierWidgetComponent
{
public:
	class UClass*                                      m_actorNameplateWidgetClass;                              // 0x0730(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UActorNameplateWidgetRelationshipData*       m_defaultRelationshipBasedWidgetData;                     // 0x0738(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FText                                       m_actorName;                                              // 0x0740(0x0018) (Edit)
	struct FText                                       m_actorType;                                              // 0x0758(0x0018) (Edit)
	bool                                               m_overrideNameIfPossessed;                                // 0x0770(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0771(0x0007) MISSED OFFSET
	class UActorNameplateWidgetObject*                 m_actorNameplateWidgetObject;                             // 0x0778(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorNameplateWidgetComponent");
		return ptr;
	}

};


// Class Robogore.ActorNameplateWidgetObject
// 0x0048 (0x00E0 - 0x0098)
class UActorNameplateWidgetObject : public UBaseActorIdentifierWidgetObject
{
public:
	class UActorNameplateWidgetRelationshipData*       m_defaultRelationshipBasedWidgetData;                     // 0x0098(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	struct FText                                       m_actorName;                                              // 0x00A0(0x0018) (Transient)
	struct FText                                       m_actorType;                                              // 0x00B8(0x0018) (Transient)
	class UActorNameplateWidget*                       m_actorNameplateWidgetInstance;                           // 0x00D0(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x00D8(0x0008) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorNameplateWidgetObject");
		return ptr;
	}

};


// Class Robogore.Operator_User
// 0x0000 (0x0418 - 0x0418)
class UOperator_User : public UOperator
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Operator_User");
		return ptr;
	}

};


// Class Robogore.Operator_Actor
// 0x0020 (0x0438 - 0x0418)
class UOperator_Actor : public UOperator_User
{
public:
	TArray<TWeakObjectPtr<class AActor>>               m_actors;                                                 // 0x0418(0x0010) (Edit, ZeroConstructor, DisableEditOnTemplate)
	TArray<struct FName>                               m_actorTags;                                              // 0x0428(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Operator_Actor");
		return ptr;
	}

};


// Class Robogore.Actor_Operator
// 0x0020 (0x0438 - 0x0418)
class UActor_Operator : public UOperator_User
{
public:
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0418(0x0010) (Edit)
	struct FOperatorActionList                         m_actionList;                                             // 0x0428(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Operator");
		return ptr;
	}

};


// Class Robogore.Actor_Tag
// 0x0028 (0x0460 - 0x0438)
class UActor_Tag : public UOperator_Actor
{
public:
	EeActorOperatorTagType                             m_actorOperatorTagType;                                   // 0x0438(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0439(0x0007) MISSED OFFSET
	TArray<struct FName>                               m_tags;                                                   // 0x0440(0x0010) (Edit, ZeroConstructor)
	unsigned char                                      UnknownData01[0x10];                                      // 0x0450(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Tag");
		return ptr;
	}

};


// Class Robogore.Actor_Kill
// 0x0010 (0x0448 - 0x0438)
class UActor_Kill : public UOperator_Actor
{
public:
	unsigned char                                      UnknownData00[0x10];                                      // 0x0438(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Kill");
		return ptr;
	}

};


// Class Robogore.Actor_Remove
// 0x0010 (0x0428 - 0x0418)
class UActor_Remove : public UOperator_User
{
public:
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0418(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Remove");
		return ptr;
	}

};


// Class Robogore.Actor_Damage
// 0x0008 (0x0440 - 0x0438)
class UActor_Damage : public UOperator_Actor
{
public:
	int16_t                                            DamageAmount;                                             // 0x0438(0x0002) (Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x043A(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Damage");
		return ptr;
	}

};


// Class Robogore.Actor_IsDestroyed
// 0x00E0 (0x0518 - 0x0438)
class UActor_IsDestroyed : public UOperator_Actor
{
public:
	unsigned char                                      UnknownData00[0xE0];                                      // 0x0438(0x00E0) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_IsDestroyed");
		return ptr;
	}

};


// Class Robogore.Actor_IsShieldDepleted
// 0x0130 (0x0568 - 0x0438)
class UActor_IsShieldDepleted : public UOperator_Actor
{
public:
	unsigned char                                      UnknownData00[0x130];                                     // 0x0438(0x0130) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_IsShieldDepleted");
		return ptr;
	}

};


// Class Robogore.Actor_ApplyGameplayEffect
// 0x0180 (0x0598 - 0x0418)
class UActor_ApplyGameplayEffect : public UOperator_User
{
public:
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0418(0x0010) (Edit)
	struct FV1GameplayEffectSpec                       m_gameplayEffect;                                         // 0x0428(0x0148) (Edit, EditConst)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0570(0x0010) UNKNOWN PROPERTY: ArrayProperty Robogore.Actor_ApplyGameplayEffect.m_premadeGamePlayEffects
	unsigned char                                      UnknownData01[0x10];                                      // 0x0580(0x0010) MISSED OFFSET
	bool                                               m_waitForEffectToComplete;                                // 0x0590(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x7];                                       // 0x0591(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_ApplyGameplayEffect");
		return ptr;
	}

};


// Class Robogore.Actor_RemoveGameplayEffect
// 0x0020 (0x0438 - 0x0418)
class UActor_RemoveGameplayEffect : public UOperator_User
{
public:
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0418(0x0010) (Edit)
	TArray<struct FGameplayTag>                        m_gameplayEffectTags;                                     // 0x0428(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_RemoveGameplayEffect");
		return ptr;
	}

};


// Class Robogore.Actor_CheckGameplayEffect
// 0x0050 (0x0468 - 0x0418)
class UActor_CheckGameplayEffect : public UOperator_User
{
public:
	struct FGameplayTagContainer                       m_uniqueGameplayEffectTags;                               // 0x0418(0x0020) (Edit)
	struct FGameplayTagContainer                       m_categoryGameplayEffectTags;                             // 0x0438(0x0020) (Edit)
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0458(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_CheckGameplayEffect");
		return ptr;
	}

};


// Class Robogore.Actor_GPOSetState
// 0x0018 (0x0430 - 0x0418)
class UActor_GPOSetState : public UOperator_User
{
public:
	EeGameplayObjectState                              m_GPOState;                                               // 0x0418(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0419(0x0007) MISSED OFFSET
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0420(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_GPOSetState");
		return ptr;
	}

};


// Class Robogore.Actor_CheckAttribute
// 0x0030 (0x0448 - 0x0418)
class UActor_CheckAttribute : public UOperator_User
{
public:
	struct FGameplayTag                                m_attributeTag;                                           // 0x0418(0x0008) (Edit)
	EeCheckAttibuteType                                m_attributeType;                                          // 0x0420(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0420(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	bool                                               m_checkStatus;                                            // 0x0424(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0425(0x0003) MISSED OFFSET
	EeCheckAttributeOp                                 m_attributeOp;                                            // 0x0428(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData02[0x3];                                       // 0x0425(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	float                                              m_checkFloat;                                             // 0x042C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              m_checkPercentage;                                        // 0x0430(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	EeCheckAttributeAgainst                            m_checkAgainst;                                           // 0x0434(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData03[0x3];                                       // 0x0434(0x0003) FIX WRONG TYPE SIZE OF PREVIOUS PROPERTY
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0438(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_CheckAttribute");
		return ptr;
	}

};


// Class Robogore.Actor_GPOCheckState
// 0x0018 (0x0430 - 0x0418)
class UActor_GPOCheckState : public UOperator_User
{
public:
	EeGameplayObjectState                              m_GPOState;                                               // 0x0418(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               m_checkAll;                                               // 0x0419(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x041A(0x0006) MISSED OFFSET
	struct FOperatorActorQueury                        m_actorQuery;                                             // 0x0420(0x0010) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_GPOCheckState");
		return ptr;
	}

};


// Class Robogore.Actor_Operator_Action
// 0x0000 (0x0030 - 0x0030)
class UActor_Operator_Action : public UObject_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.Actor_Operator_Action");
		return ptr;
	}

};


// Class Robogore.ActorAction_Wait
// 0x0000 (0x0030 - 0x0030)
class UActorAction_Wait : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_Wait");
		return ptr;
	}

};


// Class Robogore.ActorAction_SplineFollow
// 0x0020 (0x0050 - 0x0030)
class UActorAction_SplineFollow : public UActor_Operator_Action
{
public:
	class ASplineActor*                                m_spline;                                                 // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FOperatorActorQueury                        m_splineQuery;                                            // 0x0038(0x0010) (Edit)
	float                                              m_speed;                                                  // 0x0048(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	bool                                               m_loop;                                                   // 0x004C(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x004D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SplineFollow");
		return ptr;
	}

};


// Class Robogore.ActorAction_SplinePlay
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SplinePlay : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SplinePlay");
		return ptr;
	}

};


// Class Robogore.ActorAction_SplinePause
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SplinePause : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SplinePause");
		return ptr;
	}

};


// Class Robogore.ActorAction_Kill
// 0x0000 (0x0030 - 0x0030)
class UActorAction_Kill : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_Kill");
		return ptr;
	}

};


// Class Robogore.ActorAction_TagAdd
// 0x0010 (0x0040 - 0x0030)
class UActorAction_TagAdd : public UActor_Operator_Action
{
public:
	TArray<struct FName>                               m_tags;                                                   // 0x0030(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_TagAdd");
		return ptr;
	}

};


// Class Robogore.ActorAction_TagRemove
// 0x0010 (0x0040 - 0x0030)
class UActorAction_TagRemove : public UActor_Operator_Action
{
public:
	TArray<struct FName>                               m_tags;                                                   // 0x0030(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_TagRemove");
		return ptr;
	}

};


// Class Robogore.ActorAction_Damage
// 0x0008 (0x0038 - 0x0030)
class UActorAction_Damage : public UActor_Operator_Action
{
public:
	int16_t                                            m_damageAmount;                                           // 0x0030(0x0002) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0032(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_Damage");
		return ptr;
	}

};


// Class Robogore.ActorAction_GameplayTagAdd
// 0x0008 (0x0038 - 0x0030)
class UActorAction_GameplayTagAdd : public UActor_Operator_Action
{
public:
	struct FGameplayTag                                m_gameplayTag;                                            // 0x0030(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_GameplayTagAdd");
		return ptr;
	}

};


// Class Robogore.ActorAction_GameplayTagRemove
// 0x0008 (0x0038 - 0x0030)
class UActorAction_GameplayTagRemove : public UActor_Operator_Action
{
public:
	struct FGameplayTag                                m_gameplayTag;                                            // 0x0030(0x0008) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_GameplayTagRemove");
		return ptr;
	}

};


// Class Robogore.ActorAction_Remove
// 0x0000 (0x0030 - 0x0030)
class UActorAction_Remove : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_Remove");
		return ptr;
	}

};


// Class Robogore.ActorAction_EnableAllCollision
// 0x0000 (0x0030 - 0x0030)
class UActorAction_EnableAllCollision : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_EnableAllCollision");
		return ptr;
	}

};


// Class Robogore.ActorAction_DisableAllCollision
// 0x0000 (0x0030 - 0x0030)
class UActorAction_DisableAllCollision : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_DisableAllCollision");
		return ptr;
	}

};


// Class Robogore.ActorAction_EnableRendering
// 0x0000 (0x0030 - 0x0030)
class UActorAction_EnableRendering : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_EnableRendering");
		return ptr;
	}

};


// Class Robogore.ActorAction_DisableRendering
// 0x0000 (0x0030 - 0x0030)
class UActorAction_DisableRendering : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_DisableRendering");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetTeamId
// 0x0008 (0x0038 - 0x0030)
class UActorAction_SetTeamId : public UActor_Operator_Action
{
public:
	EeTeamID                                           m_newTeamId;                                              // 0x0030(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetTeamId");
		return ptr;
	}

};


// Class Robogore.ActorAction_AddObjectiveIncrementer
// 0x0010 (0x0040 - 0x0030)
class UActorAction_AddObjectiveIncrementer : public UActor_Operator_Action
{
public:
	struct FName                                       m_objectiveLookupName;                                    // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EeOnActor                                          m_onActor;                                                // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	uint32_t                                           m_incrementBy;                                            // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_AddObjectiveIncrementer");
		return ptr;
	}

};


// Class Robogore.ActorAction_AddObjectiveDecrementer
// 0x0010 (0x0040 - 0x0030)
class UActorAction_AddObjectiveDecrementer : public UActor_Operator_Action
{
public:
	struct FName                                       m_objectiveLookupName;                                    // 0x0030(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	EeOnActor                                          m_onActor;                                                // 0x0038(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0039(0x0003) MISSED OFFSET
	uint32_t                                           m_decrementBy;                                            // 0x003C(0x0004) (Edit, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_AddObjectiveDecrementer");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetScanned
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SetScanned : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetScanned");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetNotScanned
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SetNotScanned : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetNotScanned");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetInteractable
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SetInteractable : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetInteractable");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetNotInteractable
// 0x0000 (0x0030 - 0x0030)
class UActorAction_SetNotInteractable : public UActor_Operator_Action
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetNotInteractable");
		return ptr;
	}

};


// Class Robogore.ActorAction_SetGPOState
// 0x0008 (0x0038 - 0x0030)
class UActorAction_SetGPOState : public UActor_Operator_Action
{
public:
	EeGameplayObjectState                              m_GPOState;                                               // 0x0030(0x0001) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0031(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.ActorAction_SetGPOState");
		return ptr;
	}

};


// Class Robogore.AdDataAsset
// 0x0020 (0x0050 - 0x0030)
class UAdDataAsset : public UDataAsset
{
public:
	struct FAdCollection                               m_adCollection;                                           // 0x0030(0x0020) (Edit)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AdDataAsset");
		return ptr;
	}

};


// Class Robogore.AddHealthEvent
// 0x0008 (0x0070 - 0x0068)
class UAddHealthEvent : public UInstigatorEvent
{
public:
	int                                                healthToAdd;                                              // 0x0068(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x006C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AddHealthEvent");
		return ptr;
	}

};


// Class Robogore.AddWantedVisionDisruptionEvent
// 0x0008 (0x0040 - 0x0038)
class UAddWantedVisionDisruptionEvent : public UV1EventBase
{
public:
	float                                              wantedDisruptionStrength;                                 // 0x0038(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x003C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AddWantedVisionDisruptionEvent");
		return ptr;
	}

};


// Class Robogore.AdWidget
// 0x0038 (0x0270 - 0x0238)
class UAdWidget : public UV1UserWidget
{
public:
	class UImage*                                      m_adImage;                                                // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_adTitleText;                                            // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_adDescriptionText;                                      // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	struct FString                                     m_adImagePath;                                            // 0x0250(0x0010) (ZeroConstructor, Transient)
	unsigned char                                      UnknownData00[0x10];                                      // 0x0260(0x0010) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AdWidget");
		return ptr;
	}

};


// Class Robogore.AfterMissionStatsWidget
// 0x0028 (0x0260 - 0x0238)
class UAfterMissionStatsWidget : public UV1UserWidget
{
public:
	class UV1TextBlock*                                m_missionTimeText;                                        // 0x0238(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_chipsFoundText;                                         // 0x0240(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_totalSalvageText;                                       // 0x0248(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_salvagePilesText;                                       // 0x0250(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1TextBlock*                                m_difficultyText;                                         // 0x0258(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AfterMissionStatsWidget");
		return ptr;
	}

};


// Class Robogore.AICoverComponent
// 0x00D0 (0x01F8 - 0x0128)
class UAICoverComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0128(0x0008) MISSED OFFSET
	float                                              m_recentlyVisitedNodeDelay;                               // 0x0130(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      m_clearAllPreviouslyVisitedNodesOnAlert : 1;              // 0x0134(0x0001) (Edit)
	unsigned char                                      UnknownData01[0x3];                                       // 0x0135(0x0003) MISSED OFFSET
	TMap<struct FGameplayTag, class UClass*>           m_coverSelectorClasses;                                   // 0x0138(0x0050) (Edit, ZeroConstructor)
	TMap<struct FGameplayTag, class UV1AISelector*>    m_coverSelectorMap;                                       // 0x0188(0x0050) (ZeroConstructor, Transient)
	TArray<class UV1AISelector*>                       m_coverSelectors;                                         // 0x01D8(0x0010) (Edit, ZeroConstructor)
	TWeakObjectPtr<class UCoverNode>                   m_currentCoverNode;                                       // 0x01E8(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	class UV1AISelector*                               m_lastUsedSelector;                                       // 0x01F0(0x0008) (ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AICoverComponent");
		return ptr;
	}

};


// Class Robogore.AICoverInterface
// 0x0000 (0x0028 - 0x0028)
class UAICoverInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.AICoverInterface");
		return ptr;
	}

};


// Class Robogore.V1AIFilter
// 0x0008 (0x0030 - 0x0028)
class UV1AIFilter : public UObject
{
public:
	bool                                               m_isInstanced;                                            // 0x0028(0x0001) (Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0029(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class Robogore.V1AIFilter");
		return ptr;
	}

};


// Class Robogore.AIFilter_AttackableCover
// 0x0008 (0x0038 - 0x0030)
class UAIFilter_AttackableCover : public UV1AIFilter
{
public:
	float                                              m_minAllowedCoverForwardDotProduct;                       // 0x0030(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0034(0x0004) MISSED OFFSET

