#pragma once

// Name: Robogore, Version: 1.1.176

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Classes
//---------------------------------------------------------------------------

// Class V1CoreRuntime.V1ActionBase
// 0x0008 (0x0030 - 0x0028)
class UV1ActionBase : public UObject
{
public:
	bool                                               m_started;                                                // 0x0028(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               m_finished;                                               // 0x0029(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	bool                                               m_blocking;                                               // 0x002A(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               m_paused;                                                 // 0x002B(0x0001) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x002C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1ActionBase");
		return ptr;
	}


	class UV1ActionBase* Unpause();
	class UV1ActionBase* Unblock();
	void Tick(float* dt);
	void Start();
	void SetStarted(bool* Started);
	void SetPaused(bool* paused);
	void SetFinished(bool* finished);
	void SetBlocking(bool* blocking);
	void Reset();
	class UV1ActionBase* Pause();
	bool IsStarted();
	bool IsPaused();
	bool IsFinished();
	bool IsBlocking();
	void Complete();
	class UV1ActionBase* Block();
};


// Class V1CoreRuntime.V1IntervalAction
// 0x0008 (0x0038 - 0x0030)
class UV1IntervalAction : public UV1ActionBase
{
public:
	float                                              m_actionLength;                                           // 0x0030(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_executionTime;                                          // 0x0034(0x0004) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1IntervalAction");
		return ptr;
	}


	void Update(float* dt);
	void SetActionLength(float* newLength);
	void PreBegin();
	float GetInterval();
	float GetExecutionTime();
	float GetActionLength();
	void End();
	void Begin();
};


// Class V1CoreRuntime.IntervalActorAction
// 0x0010 (0x0048 - 0x0038)
class UIntervalActorAction : public UV1IntervalAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	class AActor*                                      m_actor;                                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.IntervalActorAction");
		return ptr;
	}


	void SetActor(class AActor** Actor);
	class AActor* GetActor();
};


// Class V1CoreRuntime.ActionActorTransformBase
// 0x0038 (0x0080 - 0x0048)
class UActionActorTransformBase : public UIntervalActorAction
{
public:
	bool                                               m_localSpace;                                             // 0x0048(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EeActionTransformComponent                         m_transformComponent;                                     // 0x0049(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x004A(0x0006) MISSED OFFSET
	struct FTransform                                  m_transform;                                              // 0x0050(0x0030) (Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorTransformBase");
		return ptr;
	}


	void SetLocalSpace(bool* localSpace);
	bool IsLocalSpace();
};


// Class V1CoreRuntime.ActionActorTransformBy
// 0x0040 (0x00C0 - 0x0080)
class UActionActorTransformBy : public UActionActorTransformBase
{
public:
	struct FTransform                                  m_lastTransform;                                          // 0x0080(0x0030) (Transient, IsPlainOldData)
	struct FVector                                     m_expectedScaleChange;                                    // 0x00B0(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorTransformBy");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionActorRotateBy
// 0x0010 (0x00D0 - 0x00C0)
class UActionActorRotateBy : public UActionActorTransformBy
{
public:
	struct FRotator                                    m_rotationDelta;                                          // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorRotateBy");
		return ptr;
	}


	void SetRotationDelta(struct FRotator* rotationDelta);
	struct FRotator GetRotationDelta();
	class UActionActorRotateBy* STATIC_CreateAction_ActorRotateBy(class UObject** Outer, class AActor** Actor, bool* Local, struct FRotator* rotationDelta, float* Length);
};


// Class V1CoreRuntime.ActionActorTransformTo
// 0x0030 (0x00B0 - 0x0080)
class UActionActorTransformTo : public UActionActorTransformBase
{
public:
	struct FTransform                                  m_startTransform;                                         // 0x0080(0x0030) (Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorTransformTo");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionActorRotateTo
// 0x0010 (0x00C0 - 0x00B0)
class UActionActorRotateTo : public UActionActorTransformTo
{
public:
	struct FRotator                                    m_rotation;                                               // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorRotateTo");
		return ptr;
	}


	void SetRotation(struct FRotator* Rotation);
	struct FRotator GetRotationDelta();
	class UActionActorRotateTo* STATIC_CreateAction_ActorRotateTo(class UObject** Outer, class AActor** Actor, bool* Local, struct FRotator* Rotation, float* Length);
};


// Class V1CoreRuntime.ActionActorScaleBy
// 0x0010 (0x00D0 - 0x00C0)
class UActionActorScaleBy : public UActionActorTransformBy
{
public:
	struct FVector                                     m_scaleDelta;                                             // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorScaleBy");
		return ptr;
	}


	void SetScaleDelta(struct FVector* scaleDelta);
	struct FVector GetScaleDelta();
	class UActionActorScaleBy* STATIC_CreateAction_ActorScaleBy(class UObject** Outer, class AActor** Actor, bool* Local, struct FVector* scaleDelta, float* Length);
};


// Class V1CoreRuntime.ActionActorScaleTo
// 0x0010 (0x00C0 - 0x00B0)
class UActionActorScaleTo : public UActionActorTransformTo
{
public:
	struct FVector                                     m_scale;                                                  // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorScaleTo");
		return ptr;
	}


	void SetScale(struct FVector* Scale);
	struct FVector GetScale();
	class UActionActorScaleTo* STATIC_CreateAction_ActorScaleTo(class UObject** Outer, class AActor** Actor, bool* Local, struct FVector* Scale, float* Length);
};


// Class V1CoreRuntime.ActionActorTranslateBy
// 0x0010 (0x00D0 - 0x00C0)
class UActionActorTranslateBy : public UActionActorTransformBy
{
public:
	struct FVector                                     m_translationDelta;                                       // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorTranslateBy");
		return ptr;
	}


	void SetPositionDelta(struct FVector* positionDelta);
	struct FVector GetPositionDelta();
	class UActionActorTranslateBy* STATIC_CreateAction_ActorTranslateBy(class UObject** Outer, class AActor** Actor, bool* Local, struct FVector* translationDelta, float* Length);
};


// Class V1CoreRuntime.ActionActorTranslateTo
// 0x0010 (0x00C0 - 0x00B0)
class UActionActorTranslateTo : public UActionActorTransformTo
{
public:
	struct FVector                                     m_translation;                                            // 0x00B0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionActorTranslateTo");
		return ptr;
	}


	void SetPosition(struct FVector* Position);
	struct FVector GetPosition();
	class UActionActorTranslateTo* STATIC_CreateAction_ActorTranslateTo(class UObject** Outer, class AActor** Actor, bool* Local, struct FVector* Translation, float* Length);
};


// Class V1CoreRuntime.V1InstantAction
// 0x0000 (0x0030 - 0x0030)
class UV1InstantAction : public UV1ActionBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1InstantAction");
		return ptr;
	}


	void PreExecute();
	void PostExecute();
	void Execute();
};


// Class V1CoreRuntime.InstantActorAction
// 0x0010 (0x0040 - 0x0030)
class UInstantActorAction : public UV1InstantAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
	class AActor*                                      m_actor;                                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.InstantActorAction");
		return ptr;
	}


	void SetActor(class AActor** Actor);
	class AActor* GetActor();
};


// Class V1CoreRuntime.ActionChangeActorTransform
// 0x0040 (0x0080 - 0x0040)
class UActionChangeActorTransform : public UInstantActorAction
{
public:
	bool                                               m_localSpace;                                             // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0041(0x000F) MISSED OFFSET
	struct FTransform                                  m_transformDelta;                                         // 0x0050(0x0030) (Edit, BlueprintVisible, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionChangeActorTransform");
		return ptr;
	}


	void SetTransformDelta(struct FTransform* transformDelta);
	void SetScaleDelta(struct FVector* scaleDelta);
	void SetRotationDelta(struct FRotator* rotationDelta);
	void SetPositionDelta(struct FVector* positionDelta);
	void SetLocalSpace(bool* localSpace);
	bool IsLocalSpace();
	struct FTransform GetTransformDelta();
	struct FVector GetScaleDelta();
	struct FRotator GetRotationDelta();
	struct FVector GetPositionDelta();
	class UActionChangeActorTransform* STATIC_CreateAction_ChangeActorTransform(class UObject** Outer, class AActor** Actor, bool* Local, struct FTransform* transformDelta);
};


// Class V1CoreRuntime.InstantComponentAction
// 0x0020 (0x0050 - 0x0030)
class UInstantComponentAction : public UV1InstantAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
	class AActor*                                      m_actor;                                                  // 0x0038(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_componentName;                                          // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UActorComponent*                             m_component;                                              // 0x0048(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.InstantComponentAction");
		return ptr;
	}


	void SetComponentByActor(class AActor** Actor, struct FName* componentName);
	void SetComponent(class UActorComponent** Component);
	void SetActor(class AActor** Actor);
	class UActorComponent* GetComponent();
};


// Class V1CoreRuntime.ActionComponentInstantTransformBy
// 0x0040 (0x0090 - 0x0050)
class UActionComponentInstantTransformBy : public UInstantComponentAction
{
public:
	bool                                               m_local;                                                  // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0051(0x000F) MISSED OFFSET
	struct FTransform                                  m_transform;                                              // 0x0060(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentInstantTransformBy");
		return ptr;
	}


	void SetTransform(struct FTransform* Transform);
	void SetLocal(bool* Local);
	struct FTransform GetTransform();
	bool GetLocal();
	class UActionComponentInstantTransformBy* STATIC_CreateAction_ComponentInstantTransformTo(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FTransform* Transform);
};


// Class V1CoreRuntime.ActionComponentInstantTransformTo
// 0x0040 (0x0090 - 0x0050)
class UActionComponentInstantTransformTo : public UInstantComponentAction
{
public:
	bool                                               m_local;                                                  // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0051(0x000F) MISSED OFFSET
	struct FTransform                                  m_transform;                                              // 0x0060(0x0030) (Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentInstantTransformTo");
		return ptr;
	}


	void SetTransform(struct FTransform* Transform);
	void SetLocal(bool* Local);
	struct FTransform GetTransform();
	bool GetLocal();
	class UActionComponentInstantTransformTo* STATIC_CreateAction_ComponentInstantTransformTo(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FTransform* Transform);
};


// Class V1CoreRuntime.IntervalComponentAction
// 0x0020 (0x0058 - 0x0038)
class UIntervalComponentAction : public UV1IntervalAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	class AActor*                                      m_actor;                                                  // 0x0040(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_componentName;                                          // 0x0048(0x0008) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class UActorComponent*                             m_component;                                              // 0x0050(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.IntervalComponentAction");
		return ptr;
	}


	void SetComponentByActor(class AActor** Actor, struct FName* componentName);
	void SetComponent(class UActorComponent** Component);
	void SetActor(class AActor** Actor);
	class UActorComponent* GetComponent();
};


// Class V1CoreRuntime.ActionComponentTransformBase
// 0x0038 (0x0090 - 0x0058)
class UActionComponentTransformBase : public UIntervalComponentAction
{
public:
	bool                                               m_localSpace;                                             // 0x0058(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	EeActionTransformComponent                         m_transformComponent;                                     // 0x0059(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x005A(0x0006) MISSED OFFSET
	struct FTransform                                  m_transform;                                              // 0x0060(0x0030) (Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentTransformBase");
		return ptr;
	}


	void SetLocalSpace(bool* localSpace);
	bool IsLocalSpace();
};


// Class V1CoreRuntime.ActionComponentTransformBy
// 0x0040 (0x00D0 - 0x0090)
class UActionComponentTransformBy : public UActionComponentTransformBase
{
public:
	struct FTransform                                  m_lastTransform;                                          // 0x0090(0x0030) (Transient, IsPlainOldData)
	struct FVector                                     m_expectedScaleChange;                                    // 0x00C0(0x000C) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentTransformBy");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionComponentRotateBy
// 0x0010 (0x00E0 - 0x00D0)
class UActionComponentRotateBy : public UActionComponentTransformBy
{
public:
	struct FRotator                                    m_rotationDelta;                                          // 0x00D0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentRotateBy");
		return ptr;
	}


	void SetRotationDelta(struct FRotator* rotationDelta);
	struct FRotator GetRotationDelta();
	class UActionComponentRotateBy* STATIC_CreateAction_ComponentRotateBy(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FRotator* rotationDelta, float* Length);
};


// Class V1CoreRuntime.ActionComponentTransformTo
// 0x0030 (0x00C0 - 0x0090)
class UActionComponentTransformTo : public UActionComponentTransformBase
{
public:
	struct FTransform                                  m_startTransform;                                         // 0x0090(0x0030) (Transient, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentTransformTo");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionComponentRotateTo
// 0x0010 (0x00D0 - 0x00C0)
class UActionComponentRotateTo : public UActionComponentTransformTo
{
public:
	struct FRotator                                    m_rotation;                                               // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentRotateTo");
		return ptr;
	}


	void SetRotation(struct FRotator* Rotation);
	struct FRotator GetRotation();
	class UActionComponentRotateTo* STATIC_CreateAction_ComponentRotateTo(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FRotator* Rotation, float* Length);
};


// Class V1CoreRuntime.ActionComponentScaleBy
// 0x0010 (0x00E0 - 0x00D0)
class UActionComponentScaleBy : public UActionComponentTransformBy
{
public:
	struct FVector                                     m_scaleDelta;                                             // 0x00D0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentScaleBy");
		return ptr;
	}


	void SetScaleDelta(struct FVector* scaleDelta);
	struct FVector GetScaleDelta();
	class UActionComponentScaleBy* STATIC_CreateAction_ComponentScaleBy(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FVector* scaleDelta, float* Length);
};


// Class V1CoreRuntime.ActionComponentScaleTo
// 0x0010 (0x00E0 - 0x00D0)
class UActionComponentScaleTo : public UActionComponentTransformBy
{
public:
	struct FVector                                     m_scale;                                                  // 0x00D0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentScaleTo");
		return ptr;
	}


	void SetScale(struct FVector* Scale);
	struct FVector GetScale();
	class UActionComponentScaleTo* STATIC_CreateAction_ComponentScaleTo(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FVector* Scale, float* Length);
};


// Class V1CoreRuntime.ActionComponentSetVisibility
// 0x0008 (0x0058 - 0x0050)
class UActionComponentSetVisibility : public UInstantComponentAction
{
public:
	bool                                               m_visible;                                                // 0x0050(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	bool                                               m_applyToChildren;                                        // 0x0051(0x0001) (Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0052(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentSetVisibility");
		return ptr;
	}


	void SetVisible(bool* Visible);
	void SetApplyToChildren(bool* applyToChildren);
	bool GetVisible();
	bool GetApplyToChildren();
	class UActionComponentSetVisibility* STATIC_CreateAction_ComponentSetVisibility(class UObject** Outer, class USceneComponent** Component, bool* Visible, bool* applyToChildren);
};


// Class V1CoreRuntime.ActionComponentTranslateBy
// 0x0010 (0x00E0 - 0x00D0)
class UActionComponentTranslateBy : public UActionComponentTransformBy
{
public:
	struct FVector                                     m_translationDelta;                                       // 0x00D0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00DC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentTranslateBy");
		return ptr;
	}


	void SetPositionDelta(struct FVector* positionDelta);
	struct FVector GetPositionDelta();
	class UActionComponentTranslateBy* STATIC_CreateAction_ComponentTranslateBy(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FVector* translationDelta, float* Length);
};


// Class V1CoreRuntime.ActionComponentTranslateTo
// 0x0010 (0x00D0 - 0x00C0)
class UActionComponentTranslateTo : public UActionComponentTransformTo
{
public:
	struct FVector                                     m_translation;                                            // 0x00C0(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00CC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionComponentTranslateTo");
		return ptr;
	}


	void SetPosition(struct FVector* Position);
	struct FVector GetPosition();
	class UActionComponentTranslateTo* STATIC_CreateAction_ComponentTranslateTo(class UObject** Outer, class USceneComponent** Component, bool* Local, struct FVector* Translation, float* Length);
};


// Class V1CoreRuntime.ActionDestroyActor
// 0x0000 (0x0040 - 0x0040)
class UActionDestroyActor : public UInstantActorAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionDestroyActor");
		return ptr;
	}


	class UActionDestroyActor* STATIC_CreateAction_DestroyActor(class UObject** Outer, class AActor** Actor);
};


// Class V1CoreRuntime.V1ActionContainer
// 0x0010 (0x0040 - 0x0030)
class UV1ActionContainer : public UV1ActionBase
{
public:
	TArray<class UV1ActionBase*>                       m_actions;                                                // 0x0030(0x0010) (Edit, BlueprintVisible, ExportObject, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1ActionContainer");
		return ptr;
	}


	bool IsEmpty();
	TArray<class UV1ActionBase*> GetActions();
	int GetActionCount();
	void Clear();
	class UV1ActionBase* AddActionFront(class UV1ActionBase** Action);
	class UV1ActionBase* AddActionBack(class UV1ActionBase** Action);
};


// Class V1CoreRuntime.ActionRepeatFinite
// 0x0010 (0x0050 - 0x0040)
class UActionRepeatFinite : public UV1ActionContainer
{
public:
	int                                                m_iterations;                                             // 0x0040(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                m_sequencesCompleted;                                     // 0x0044(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	int                                                m_actionsCompleted;                                       // 0x0048(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x004C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionRepeatFinite");
		return ptr;
	}


	class UActionRepeatFinite* STATIC_CreateAction_ActionRepeatFinite(class UObject** Outer, int* iterations);
};


// Class V1CoreRuntime.ActionRepeatForever
// 0x0008 (0x0048 - 0x0040)
class UActionRepeatForever : public UV1ActionContainer
{
public:
	int                                                m_completed;                                              // 0x0040(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0044(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionRepeatForever");
		return ptr;
	}


	class UActionRepeatForever* STATIC_CreateAction_ActionRepeatForever(class UObject** Outer);
};


// Class V1CoreRuntime.ActionSetActorTransform
// 0x0040 (0x0080 - 0x0040)
class UActionSetActorTransform : public UInstantActorAction
{
public:
	bool                                               m_localSpace;                                             // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0xF];                                       // 0x0041(0x000F) MISSED OFFSET
	struct FTransform                                  m_transform;                                              // 0x0050(0x0030) (Edit, BlueprintVisible, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionSetActorTransform");
		return ptr;
	}


	void SetTransform(struct FTransform* transformDelta);
	void SetScale(struct FVector* scaleDelta);
	void SetRotation(struct FRotator* rotationDelta);
	void SetPosition(struct FVector* positionDelta);
	void SetLocalSpace(bool* localSpace);
	bool IsLocalSpace();
	struct FTransform GetTransform();
	struct FVector GetScale();
	struct FRotator GetRotation();
	struct FVector GetPosition();
	class UActionSetActorTransform* STATIC_CreateAction_SetActorTransform(class UObject** Outer, class AActor** Actor, bool* Local, struct FTransform* Transform);
};


// Class V1CoreRuntime.ActionSetActorVisibility
// 0x0008 (0x0048 - 0x0040)
class UActionSetActorVisibility : public UInstantActorAction
{
public:
	bool                                               m_visible;                                                // 0x0040(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	bool                                               m_applyToChildren;                                        // 0x0041(0x0001) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x0042(0x0006) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionSetActorVisibility");
		return ptr;
	}


	class UActionSetActorVisibility* STATIC_CreateAction_SetActorVisibility(class UObject** Outer, class AActor** Actor, bool* Visible, bool* applyToChildren);
};


// Class V1CoreRuntime.ActionSpawnActor
// 0x0050 (0x0080 - 0x0030)
class UActionSpawnActor : public UV1InstantAction
{
public:
	class UClass*                                      m_actorClass;                                             // 0x0030(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	struct FTransform                                  m_spawnTransform;                                         // 0x0040(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FName                                       m_actorName;                                              // 0x0070(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_actorTag;                                               // 0x0078(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionSpawnActor");
		return ptr;
	}


	void SetSpawnTransform(struct FTransform* SpawnTransform);
	void SetActorTag(struct FName* componentTag);
	void SetActorName(struct FName* actorName);
	void SetActorClass(class UClass** actorClass);
	struct FTransform GetSpawnTransform();
	struct FName GetActorTag();
	struct FName GetActorName();
	class UClass* GetActorClass();
	class UActionSpawnActor* STATIC_CreateAction_SpawnActor(class UObject** Outer, class UClass** actorClass, struct FTransform* SpawnTransform, struct FName* actorName, struct FName* actorTag);
};


// Class V1CoreRuntime.ActionSpawnComponent
// 0x0050 (0x0090 - 0x0040)
class UActionSpawnComponent : public UInstantActorAction
{
public:
	class UClass*                                      m_componentClass;                                         // 0x0040(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x8];                                       // 0x0048(0x0008) MISSED OFFSET
	struct FTransform                                  m_spawnTransform;                                         // 0x0050(0x0030) (Edit, BlueprintVisible, IsPlainOldData)
	struct FName                                       m_componentName;                                          // 0x0080(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FName                                       m_componentTag;                                           // 0x0088(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionSpawnComponent");
		return ptr;
	}


	void SetSpawnTransform(struct FTransform* SpawnTransform);
	void SetComponentTag(struct FName* componentTag);
	void SetComponentName(struct FName* componentName);
	void SetComponentClass(class UClass** actorClass);
	struct FTransform GetSpawnTransform();
	struct FName GetComponentTag();
	struct FName GetComponentName();
	class UClass* GetComponentClass();
	class UActionSpawnComponent* STATIC_CreateAction_SpawnComponent(class UObject** Outer, class AActor** Actor, class UClass** ComponentClass, struct FTransform* SpawnTransform, struct FName* componentName, struct FName* componentTag);
};


// Class V1CoreRuntime.V1ActionBaseMock
// 0x0000 (0x0030 - 0x0030)
class UV1ActionBaseMock : public UV1ActionBase
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1ActionBaseMock");
		return ptr;
	}

};


// Class V1CoreRuntime.V1InstantActionMock
// 0x0000 (0x0030 - 0x0030)
class UV1InstantActionMock : public UV1InstantAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1InstantActionMock");
		return ptr;
	}

};


// Class V1CoreRuntime.V1IntervalActionMock
// 0x0000 (0x0038 - 0x0038)
class UV1IntervalActionMock : public UV1IntervalAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1IntervalActionMock");
		return ptr;
	}

};


// Class V1CoreRuntime.IntervalUMGAction
// 0x0010 (0x0048 - 0x0038)
class UIntervalUMGAction : public UV1IntervalAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0038(0x0008) MISSED OFFSET
	class UWidget*                                     m_widget;                                                 // 0x0040(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.IntervalUMGAction");
		return ptr;
	}


	void SetWidget(class UWidget** Widget);
	class UWidget* GetWidget();
};


// Class V1CoreRuntime.ActionUMGFadeAlphaTo
// 0x0030 (0x0078 - 0x0048)
class UActionUMGFadeAlphaTo : public UIntervalUMGAction
{
public:
	float                                              m_targetAlpha;                                            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_startAlpha;                                             // 0x004C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FUMGColorWrapper                            m_colorWrapper;                                           // 0x0050(0x0028) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGFadeAlphaTo");
		return ptr;
	}


	void SetTargetAlpha(float* targetAlpha);
	float GetTargetAlpha();
	class UActionUMGFadeAlphaTo* STATIC_CreateAction_UMGFadeAlphaTo(class UObject** Outer, class UWidget** Widget, float* targetAlpha, float* Length);
};


// Class V1CoreRuntime.ActionUMGFadeColorTo
// 0x0048 (0x0090 - 0x0048)
class UActionUMGFadeColorTo : public UIntervalUMGAction
{
public:
	struct FLinearColor                                m_color;                                                  // 0x0048(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                m_startColor;                                             // 0x0058(0x0010) (ZeroConstructor, Transient, IsPlainOldData)
	struct FUMGColorWrapper                            m_colorWrapper;                                           // 0x0068(0x0028) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGFadeColorTo");
		return ptr;
	}


	void SetFadeColor(struct FLinearColor* Color);
	struct FLinearColor GetFadeColor();
	class UActionUMGFadeColorTo* STATIC_CreateAction_UMGFadeColorTo(class UObject** Outer, class UWidget** Widget, struct FLinearColor* Color, float* Length);
};


// Class V1CoreRuntime.ActionUMGMultiplyAlphaBy
// 0x0030 (0x0078 - 0x0048)
class UActionUMGMultiplyAlphaBy : public UIntervalUMGAction
{
public:
	float                                              m_alphaScalar;                                            // 0x0048(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	float                                              m_startAlpha;                                             // 0x004C(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	struct FUMGColorWrapper                            m_colorWrapper;                                           // 0x0050(0x0028) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGMultiplyAlphaBy");
		return ptr;
	}


	void SetAlphaScalar(float* alphaScalar);
	float GetAlphaScalar();
	class UActionUMGMultiplyAlphaBy* STATIC_CreateAction_UMGMultiplyAlphaBy(class UObject** Outer, class UWidget** Widget, float* alphaScalar, float* Length);
};


// Class V1CoreRuntime.ActionUMGMultiplyColorBy
// 0x0048 (0x0090 - 0x0048)
class UActionUMGMultiplyColorBy : public UIntervalUMGAction
{
public:
	struct FVector                                     m_colorScalar;                                            // 0x0048(0x000C) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                m_startColor;                                             // 0x0054(0x0010) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	struct FUMGColorWrapper                            m_colorWrapper;                                           // 0x0068(0x0028) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGMultiplyColorBy");
		return ptr;
	}


	void SetColorScalar(struct FVector* colorScalar);
	struct FVector GetColorScalar();
	class UActionUMGMultiplyColorBy* STATIC_CreateAction_UMGMultiplyColorBy(class UObject** Outer, class UWidget** Widget, struct FVector* colorScalar, float* Length);
};


// Class V1CoreRuntime.InstantUMGAction
// 0x0010 (0x0040 - 0x0030)
class UInstantUMGAction : public UV1InstantAction
{
public:
	unsigned char                                      UnknownData00[0x8];                                       // 0x0030(0x0008) MISSED OFFSET
	class UWidget*                                     m_widget;                                                 // 0x0038(0x0008) (ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.InstantUMGAction");
		return ptr;
	}


	void SetWidget(class UWidget** Widget);
	class UWidget* GetWidget();
};


// Class V1CoreRuntime.ActionUMGRemoveFromParent
// 0x0000 (0x0040 - 0x0040)
class UActionUMGRemoveFromParent : public UInstantUMGAction
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGRemoveFromParent");
		return ptr;
	}


	class UActionUMGRemoveFromParent* STATIC_CreateAction_UMGRemoveFromParent(class UObject** Outer, class UWidget** Widget);
};


// Class V1CoreRuntime.ActionUMGTransformBase
// 0x0028 (0x0070 - 0x0048)
class UActionUMGTransformBase : public UIntervalUMGAction
{
public:
	EeActionUMGTransformComponent                      m_transformComponent;                                     // 0x0048(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x3];                                       // 0x0049(0x0003) MISSED OFFSET
	struct FUMGActionTransform                         m_transform;                                              // 0x004C(0x0024) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGTransformBase");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionUMGTransformBy
// 0x0030 (0x00A0 - 0x0070)
class UActionUMGTransformBy : public UActionUMGTransformBase
{
public:
	struct FUMGActionTransform                         m_lastTransform;                                          // 0x0070(0x0024) (Transient)
	struct FVector2D                                   m_expectedScaleChange;                                    // 0x0094(0x0008) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x009C(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGTransformBy");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionUMGRotateBy
// 0x0008 (0x00A8 - 0x00A0)
class UActionUMGRotateBy : public UActionUMGTransformBy
{
public:
	float                                              m_rotationDelta;                                          // 0x00A0(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00A4(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGRotateBy");
		return ptr;
	}


	void SetRotationDelta(float* rotationDelta);
	float GetRotationDelta();
	class UActionUMGRotateBy* STATIC_CreateAction_UMGRotateBy(class UObject** Outer, class UWidget** Widget, float* rotationDelta, float* Length);
};


// Class V1CoreRuntime.ActionUMGTransformTo
// 0x0048 (0x00B8 - 0x0070)
class UActionUMGTransformTo : public UActionUMGTransformBase
{
public:
	struct FUMGActionTransform                         m_startTransform;                                         // 0x0070(0x0024) (Transient)
	struct FUMGActionTransform                         m_deltaTransform;                                         // 0x0094(0x0024) (Transient)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGTransformTo");
		return ptr;
	}

};


// Class V1CoreRuntime.ActionUMGRotateTo
// 0x0008 (0x00C0 - 0x00B8)
class UActionUMGRotateTo : public UActionUMGTransformTo
{
public:
	float                                              m_rotation;                                               // 0x00B8(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x00BC(0x0004) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGRotateTo");
		return ptr;
	}


	void SetRotation(float* Rotation);
	float GetRotation();
	class UActionUMGRotateTo* STATIC_CreateAction_UMGRotateTo(class UObject** Outer, class UWidget** Widget, float* Rotation, float* Length);
};


// Class V1CoreRuntime.ActionUMGScaleBy
// 0x0008 (0x00A8 - 0x00A0)
class UActionUMGScaleBy : public UActionUMGTransformBy
{
public:
	struct FVector2D                                   m_scaleDelta;                                             // 0x00A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGScaleBy");
		return ptr;
	}


	void SetScaleDelta(struct FVector2D* scaleDelta);
	struct FVector2D GetScaleDelta();
	class UActionUMGScaleBy* STATIC_CreateAction_UMGScaleBy(class UObject** Outer, class UWidget** Widget, struct FVector2D* scaleDelta, float* Length);
};


// Class V1CoreRuntime.ActionUMGScaleTo
// 0x0008 (0x00C0 - 0x00B8)
class UActionUMGScaleTo : public UActionUMGTransformTo
{
public:
	struct FVector2D                                   m_scale;                                                  // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGScaleTo");
		return ptr;
	}


	void SetScale(struct FVector2D* Scale);
	struct FVector2D GetScale();
	class UActionUMGScaleTo* STATIC_CreateAction_UMGScaleTo(class UObject** Outer, class UWidget** Widget, struct FVector2D* Scale, float* Length);
};


// Class V1CoreRuntime.ActionUMGTranslateBy
// 0x0008 (0x00A8 - 0x00A0)
class UActionUMGTranslateBy : public UActionUMGTransformBy
{
public:
	struct FVector2D                                   m_translationDelta;                                       // 0x00A0(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGTranslateBy");
		return ptr;
	}


	void SetPositionDelta(struct FVector2D* positionDelta);
	struct FVector2D GetPositionDelta();
	class UActionUMGTranslateBy* STATIC_CreateAction_UMGTranslateBy(class UObject** Outer, class UWidget** Widget, struct FVector2D* translationDelta, float* Length);
};


// Class V1CoreRuntime.ActionUMGTranslateTo
// 0x0008 (0x00C0 - 0x00B8)
class UActionUMGTranslateTo : public UActionUMGTransformTo
{
public:
	struct FVector2D                                   m_translation;                                            // 0x00B8(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActionUMGTranslateTo");
		return ptr;
	}


	void SetPosition(struct FVector2D* Position);
	struct FVector2D GetPosition();
	class UActionUMGTranslateTo* STATIC_CreateAction_UMGTranslateTo(class UObject** Outer, class UWidget** Widget, struct FVector2D* Translation, float* Length);
};


// Class V1CoreRuntime.ActorActionInterface
// 0x0000 (0x0028 - 0x0028)
class UActorActionInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActorActionInterface");
		return ptr;
	}


	void SetActor(class AActor** Actor);
	class AActor* GetActor();
};


// Class V1CoreRuntime.ActorLifeCycleComponent
// 0x03D8 (0x0500 - 0x0128)
class UActorLifeCycleComponent : public UActorComponent
{
public:
	unsigned char                                      UnknownData00[0x3C0];                                     // 0x0128(0x03C0) MISSED OFFSET
	EeActorLifeCycleState                              m_clientDesiredState;                                     // 0x04E8(0x0001) (Net, ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0x7];                                       // 0x04E9(0x0007) MISSED OFFSET
	TArray<struct FStateExitWait>                      m_stateExitWaits;                                         // 0x04F0(0x0010) (Edit, ZeroConstructor)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActorLifeCycleComponent");
		return ptr;
	}


	void Server_DummyRPC();
};


// Class V1CoreRuntime.ActorLifeCycleInterface
// 0x0000 (0x0028 - 0x0028)
class UActorLifeCycleInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ActorLifeCycleInterface");
		return ptr;
	}

};


// Class V1CoreRuntime.V1EventBase
// 0x0010 (0x0038 - 0x0028)
class UV1EventBase : public UObject
{
public:
	class UObject*                                     Source;                                                   // 0x0028(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)
	class AActor*                                      Target;                                                   // 0x0030(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1EventBase");
		return ptr;
	}

};


// Class V1CoreRuntime.InstigatorEvent
// 0x0030 (0x0068 - 0x0038)
class UInstigatorEvent : public UV1EventBase
{
public:
	class AActor*                                      Instigator;                                               // 0x0038(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	class APlayerController*                           instigatorController;                                     // 0x0040(0x0008) (BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData00[0x20];                                      // 0x0048(0x0020) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.InstigatorEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.ApplyGameplayEffectEvent
// 0x0160 (0x01C8 - 0x0068)
class UApplyGameplayEffectEvent : public UInstigatorEvent
{
public:
	class UClass*                                      EffectClass;                                              // 0x0068(0x0008) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FV1GameplayEffectSpec                       effectSpec;                                               // 0x0070(0x0148) (Edit, BlueprintVisible)
	class UActorComponent*                             instigatorComponent;                                      // 0x01B8(0x0008) (BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)
	class UV1GameplayEffect*                           constructedEffect;                                        // 0x01C0(0x0008) (BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ApplyGameplayEffectEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.V1AudioManagerInterface
// 0x0000 (0x0028 - 0x0028)
class UV1AudioManagerInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.V1AudioManagerInterface");
		return ptr;
	}

};


// Class V1CoreRuntime.AudioManager
// 0x0148 (0x0170 - 0x0028)
class UAudioManager : public UObject
{
public:
	uint64_t                                           m_globalAudioObjectId;                                    // 0x0028(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	struct FString                                     m_globalAudioObjectName;                                  // 0x0030(0x0010) (Edit, ZeroConstructor)
	class UAkAudioEvent*                               m_startGlobalMusicEvent;                                  // 0x0040(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               m_stopGlobalMusicEvent;                                   // 0x0048(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               m_duckAudioForTalkersEvent;                               // 0x0050(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	class UAkAudioEvent*                               m_unduckAudioForTalkersEvent;                             // 0x0058(0x0008) (Edit, ZeroConstructor, IsPlainOldData)
	int                                                m_playersTalking;                                         // 0x0060(0x0004) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x4];                                       // 0x0064(0x0004) MISSED OFFSET
	TArray<class UAkAudioBank*>                        m_globalBanks;                                            // 0x0068(0x0010) (Edit, ZeroConstructor)
	bool                                               m_globalRegistered;                                       // 0x0078(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData01[0xF7];                                      // 0x0079(0x00F7) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.AudioManager");
		return ptr;
	}

};


// Class V1CoreRuntime.OnEnterActorLifeCycleStateEvent
// 0x0008 (0x0040 - 0x0038)
class UOnEnterActorLifeCycleStateEvent : public UV1EventBase
{
public:
	class UActorLifeCycleComponent*                    ActorLifeCycleComponent;                                  // 0x0038(0x0008) (ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData)

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.OnEnterActorLifeCycleStateEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.BeginActorLifeCycleEvent
// 0x0000 (0x0040 - 0x0040)
class UBeginActorLifeCycleEvent : public UOnEnterActorLifeCycleStateEvent
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.BeginActorLifeCycleEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.BroadcastInputKeyEvent
// 0x0098 (0x00D0 - 0x0038)
class UBroadcastInputKeyEvent : public UV1EventBase
{
public:
	unsigned char                                      Handled : 1;                                              // 0x0038(0x0001) (Transient)
	TEnumAsByte<EInputEvent>                           InputEvent;                                               // 0x0039(0x0001) (ZeroConstructor, Transient, IsPlainOldData)
	unsigned char                                      UnknownData00[0x6];                                       // 0x003A(0x0006) MISSED OFFSET
	struct FPointerEvent                               PointerEvent;                                             // 0x0040(0x0070) (Transient)
	struct FKey                                        Key;                                                      // 0x00B0(0x0018) (Transient)
	unsigned char                                      isPointerEvent : 1;                                       // 0x00C8(0x0001) (Transient)
	unsigned char                                      UnknownData01[0x7];                                       // 0x00C9(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.BroadcastInputKeyEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.BroadcastPauseMenuEvent
// 0x0008 (0x0040 - 0x0038)
class UBroadcastPauseMenuEvent : public UV1EventBase
{
public:
	unsigned char                                      Handled : 1;                                              // 0x0038(0x0001)
	unsigned char                                      UnknownData00[0x7];                                       // 0x0039(0x0007) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.BroadcastPauseMenuEvent");
		return ptr;
	}

};


// Class V1CoreRuntime.CinematicCameraControlComponent
// 0x0020 (0x0930 - 0x0910)
class UCinematicCameraControlComponent : public UCineCameraComponent
{
public:
	unsigned char                                      UnknownData00[0x4];                                       // 0x0910(0x0004) MISSED OFFSET
	float                                              m_focusDistanceInputSpeed;                                // 0x0914(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	float                                              m_apertureAdjustInputSpeed;                               // 0x0918(0x0004) (Edit, ZeroConstructor, IsPlainOldData)
	unsigned char                                      UnknownData01[0x4];                                       // 0x091C(0x0004) MISSED OFFSET
	class AActor*                                      m_lookAtTrackActor;                                       // 0x0920(0x0008) (BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData)
	float                                              m_lookAtInterpSpeed;                                      // 0x0928(0x0004) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	unsigned char                                      m_isTrackingLookAt : 1;                                   // 0x092C(0x0001) (Transient)
	unsigned char                                      UnknownData02[0x3];                                       // 0x092D(0x0003) MISSED OFFSET

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.CinematicCameraControlComponent");
		return ptr;
	}

};


// Class V1CoreRuntime.ComponentActionInterface
// 0x0000 (0x0028 - 0x0028)
class UComponentActionInterface : public UInterface
{
public:

	static UClass* StaticClass()
	{
		static auto ptr = UObject::FindClass("Class V1CoreRuntime.ComponentActionInterface");
		return ptr;
	}


	void SetComponentByActor(class AActor** Actor, struct FName* componentName);
	void SetComponent(class UActorComponent** Component);
	void SetActor(class AActor** Actor);
	class UActorComponent* GetComponent();
};


// Class V1CoreRuntime.CoreRuntimeSettings
// 0x0008 (0x0030 - 0x0028)
class UCoreRuntimeSettings : public UObject
{
public:
